tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf4320_tdd.h
#define CHS1                          522
#define CHS2                          523
#define CHS3                          524
#define SSPCON2                       525
#define SEN                           526
#define RSEN                          527
#define PEN                           528
#define RCEN                          529
#define ACKEN                         530
#define ACKDT                         531
#define ACKSTAT                       532
#define GCEN                          533
#define SSPCON1                       534
#define SSPM0                         535
#define SSPM                          536
#define SSPM1                         537
#define SSPM2                         538
#define SSPM3                         539
#define CKP                           540
#define SSPEN                         541
#define SSPOV                         542
#define WCOL                          543
#define SSPSTAT                       544
#define BF                            545
#define UA                            546
#define R_NOT_W                       547
#define READ_WRITE                    548
#define NOT_W                         549
#define R_W                           550
#define RW                            551
#define R                             552
#define NOT_WRITE                     553
#define nW                            554
#define nWRITE                        555
#define R_nW                          556
#define I2C_READ                      557
#define START                         558
#define S                             559
#define I2C_START                     560
#define STOP                          561
#define I2C_STOP                      562
#define P                             563
#define NOT_A                         564
#define I2C_DATA                      565
#define nA                            566
#define D_nA                          567
#define D                             568
#define DA                            569
#define DATA_ADDRESS                  570
#define D_A                           571
#define D_NOT_A                       572
#define NOT_ADDRESS                   573
#define nADDRESS                      574
#define I2C_DAT                       575
#define CKE                           576
#define SMP                           577
#define T2CON                         578
#define T2CKPS0                       579
#define T2CKPS                        580
#define T2CKPS1                       581
#define TMR2ON                        582
#define TOUTPS0                       583
#define TOUTPS                        584
#define TOUTPS1                       585
#define TOUTPS2                       586
#define TOUTPS3                       587
#define PR2                           588
#define WM0                           589
#define WM1                           590
#define WAIT0                         591
#define WAIT1                         592
#define EBDIS                         593
#define T1CON                         594
#define TMR1ON                        595
#define TMR1CS                        596
#define NOT_T1SYNC                    597
#define T1SYNC                        598
#define nT1SYNC                       599
#define T1OSCEN                       600
#define SOSCEN                        601
#define T1CKPS0                       602
#define T1CKPS                        603
#define T1CKPS1                       604
#define T1RUN                         605
#define T1CON_RD16                    606
#define T1RD16                        607
#define RCON                          608
#define BOR                           609
#define NOT_BOR                       610
#define nBOR                          611
#define POR                           612
#define nPOR                          613
#define NOT_POR                       614
#define nPD                           615
#define NOT_PD                        616
#define PD                            617
#define NOT_TO                        618
#define nTO                           619
#define TO                            620
#define nRI                           621
#define NOT_RI                        622
#define RI                            623
#define IPEN                          624
#define WDTCON                        625
#define SWDTE                         626
#define SWDTEN                        627
#define LVDCON                        628
#define LVDL0                         629
#define LVDL                          630
#define LVDL1                         631
#define LVDL2                         632
#define LVDL3                         633
#define LVDEN                         634
#define IRVST                         635
#define IVRST                         636
#define OSCCON                        637
#define SCS0                          638
#define SCS                           639
#define SCS1                          640
#define FLTS                          641
#define IOFS                          642
#define OSTS                          643
#define IRCF                          644
#define IRCF0                         645
#define IRCF1                         646
#define IRCF2                         647
#define IDLEN                         648
#define T0CON                         649
#define T0PS                          650
#define T0PS0                         651
#define T0PS1                         652
#define T0PS2                         653
#define PSA                           654
#define T0PS3                         655
#define T0SE                          656
#define T0CS                          657
#define T08BIT                        658
#define T016BIT                       659
#define TMR0ON                        660
#define STATUS                        661
#define C                             662
#define CARRY                         663
#define DC                            664
#define ZERO                          665
#define Z                             666
#define OV                            667
#define OVERFLOW                      668
#define N                             669
#define NEGATIVE                      670
#define INTCON3                       671
#define INT1IF                        672
#define INT1F                         673
#define INT2IF                        674
#define INT2F                         675
#define INT1E                         676
#define INT1IE                        677
#define INT2IE                        678
#define INT2E                         679
#define INT1P                         680
#define INT1IP                        681
#define INT2IP                        682
#define INT2P                         683
#define INTCON2                       684
#define RBIP                          685
#define TMR0IP                        686
#define T0IP                          687
#define INTEDG2                       688
#define INTEDG1                       689
#define INTEDG0                       690
#define RBPU                          691
#define NOT_RBPU                      692
#define nRBPU                         693
#define INTCON                        694
#define RBIF                          695
#define INT0F                         696
#define INTF                          697
#define INT0IF                        698
#define T0IF                          699
#define TMR0IF                        700
#define RBIE                          701
#define INTE                          702
#define INT0E                         703
#define INT0IE                        704
#define T0IE                          705
#define TMR0IE                        706
#define PEIE                          707
#define PEIE_GIEL                     708
#define GIEL                          709
#define GIE_GIEH                      710
#define GIE                           711
#define GIEH                          712
#define STKPTR0                       713
#define STKPTR                        714
#define SP0                           715
#define STKPTR1                       716
#define SP1                           717
#define STKPTR2                       718
#define SP2                           719
#define SP3                           720
#define STKPTR3                       721
#define STKPTR4                       722
#define SP4                           723
#define STKUNF                        724
#define STKOVF                        725
#define STKFUL                        726

#endif // _PIC18LF4320_H_
